cf_billing/DataProcessors/энргСобытиеМенеджерФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргСобытиеМенеджерФорм</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргСтатусСогласованияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСтатусСогласованияСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСтатусыСогласованияСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргСобытие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСтатусВыполненияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСтатусВыполненияСобытий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Указывает выполнено ли событие или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргСобытие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСтатусыСогласованияСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСтатусыСогласованияСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТребуетСогласования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласовано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетДоработки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/энргСобытие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргСобытие</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргСобытия</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСпособСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемаяДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МакетПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Одинарный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудСудебныйУчастокДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСуды</v8:Type>
						<v8:Type>cfg:CatalogRef.энргСудебныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебнаяИнстанцияДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСудебныеИнстанции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудьяДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйАктДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.энргСтатусыСудебногоАкта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСудебногоАктаДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСудебногоАктаДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВступленияВЗаконнуюСилуДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОтветственностиДляСА</Name>
					<Comment>Реквизит для судебного акта</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.энргИсполнительнаяОтветственностьПИР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСпособыОтправкиУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРамкахЭтапа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Абоненты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:TaskRef.энргЗадачаПИД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Успех</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDЭтапа</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бестПараметрыТиповСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бестПараметрыТиповСобытий</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПросуженнаяЗадолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Потребитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Задолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаГоспошлин</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прочие</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Catalogs/энргСпособСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргСпособСвязи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтапПИР</Name>
					<Comment>Переопределен на табличную часть(Этапы ПИР).</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетСогласования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеОтправки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бестПараметрыТиповСобытий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РолиСогласующих</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргРоли</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПИР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтапПИР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаМакетовПФ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Макет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/DataProcessors/энргСобытиеМенеджерФорм/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргРаботаСПрикрепленнымиФайламиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	ЗаполнитьВходнымиДанными();
	
	УправлениеВидимостью();
	Если Параметры.Ключ.Пустая() Тогда
		ОбновитьПочтуУАбонентов();
	КонецЕсли;
	
	ИнициализироватьШаблоныСообщений();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	//УправлениеВидимостью();
	УправлениеВидимостьюФункцийПечати();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьСтатусСогласованияСобытия();
	ОбновитьСтатусВыполненияСобытия();
	ОбновитьНадписьСтатусаСобытия();
	ОбновитьПочтуУАбонентов();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	энргРаботаСПрикрепленнымиФайламиКлиент.ПослеЗаписи(ЭтотОбъект);
	
	ОбновитьСтатусСогласованияСобытия();
	ОбновитьСтатусВыполненияСобытия();
КонецПроцедуры

#КонецОбласти

#Область ОбработкаВходныхДанных

Процедура ЗаполнитьВходнымиДанными()
	Перем СписокПолучателей, Подэтапы;
	
	НеУчитоватьСв	= "";
	Если Параметры.Свойство("Абоненты", СписокПолучателей) Тогда
		НеУчитоватьСв = "Абоненты";
		Для каждого ТекСтрока Из СписокПолучателей Цикл
			СтрокаТЧ = Объект.Абоненты.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ТекСтрока);
		КонецЦикла;
	ИначеЕсли Параметры.Свойство("Договоры", СписокПолучателей) Тогда 
		Для каждого ТекСтрока Из СписокПолучателей Цикл
			СтрокаТЧ = Объект.Абоненты.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры,, НеУчитоватьСв);
	
	Если ЗначениеЗаполнено(Объект.ТипСобытия) И Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьПараметрыНаСервере();
	КонецЕсли;
	
	// Заполнение таблицы подэтапами задачи
	Если Объект.Одинарный Тогда
		//Если ЗначениеЗаполнено(Объект.Абоненты) Тогда
		//	СтрокаПолучателя = Объект.Абоненты[0];
		//Иначе 
		//	СтрокаПолучателя = Объект.Абоненты.Добавить();
		//	
		//	ЗаполнитьЗначенияСвойств(СтрокаПолучателя, Параметры); 
		//КонецЕсли;
		//
		//IDЭтапа 	= СтрокаПолучателя.IDЭтапа;
		//Выполнен 	= СтрокаПолучателя.Успех;
		//Основание 	= СтрокаПолучателя.Основание;
		//Получатель 	= СтрокаПолучателя.Абонент;
		//Результат	= СтрокаПолучателя.Результат;
		//Если ЗначениеЗаполнено(Основание) Тогда
		//	Этап 	= Основание.Этап;
		//КонецЕсли;
		//
		//Если Параметры.Свойство("Подэтапы", Подэтапы) Тогда
		//	
		//ИначеЕсли ЗначениеЗаполнено(Основание) Тогда 
		//	Подэтапы = Документы.энргСобытие.ПолучитьПодэтапыЗадачи(Основание);
		//Иначе
		//	Подэтапы = Новый Массив;
		//КонецЕсли;
		
		//Для каждого ТекПодэтап Из Подэтапы Цикл
		//	СтрокаТЗ = ПодэтапыЗадачи.Добавить();
		//	ЗаполнитьЗначенияСвойств(СтрокаТЗ, ТекПодэтап);
		//	
		//	Если ТекПодэтап.IDЭтапа = IDЭтапа Тогда
		//		Подэтап = ТекПодэтап.Подэтап;
		//	КонецЕсли;
		//КонецЦикла;
		//
		//Если Объект.Ссылка.Пустая() Тогда
		//
		//	Элементы.Параметры.ИзменятьСоставСтрок		= Истина;
		//	Элементы.ПараметрыПараметр.ТолькоПросмотр 	= Ложь;
		//
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура ТипСобытияПриИзменении(Элемент)
	УправлениеВидимостью();
	ЗаполнитьПараметрыНаСервере();
	УстановитьПараметрыВыбораПриИзмененииТипСобытия();
	ИзменитьНазванияПолейТЧ();
	УправлениеВидимостьюФункцийПечати();
КонецПроцедуры

&НаКлиенте
Процедура СпособОтправкиПриИзменении(Элемент)
	УправлениеВидимостьюФункцииОтправкиНаПочту();
	РасчитатьСрокиОУведомленииОВводеОРП();
КонецПроцедуры

&НаКлиенте
Процедура ПотребителиОснованиеПриИзменении(Элемент)
	ТекСтрока = Элементы.Абоненты.ТекущиеДанные;
	Если ТекСтрока = Неопределено Или Не ЗначениеЗаполнено(ТекСтрока.Основание) Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока.Абонент = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтрока.Основание, "Абонент");
КонецПроцедуры

&НаКлиенте
Процедура ЭтапПриИзменении(Элемент)
	НенужныеАбоненты = ПолучитьНенужныхАбонентов();
	Если НЕ НенужныеАбоненты.Количество() = 0 Тогда
		Оповещение 		= Новый ОписаниеОповещения("ПослеОтветаНаВопросУдаленияНенужныхПотребителей", ЭтотОбъект, Новый Структура("НенужныеАбоненты", НенужныеАбоненты));
		ТекстВопроса 	= 
		"Абоненты не подходящие по отбору Этап: 
		|%1. Удалить данных абонентов?";
		
		ТекстВопроса = СтрШаблон(ТекстВопроса, СтрСоединить(НенужныеАбоненты, ","));
		ПоказатьВопрос(Оповещение, ТекстВопроса , РежимДиалогаВопрос.ДаНетОтмена,,, "Очистка таблицы потребителей");	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтветаНаВопросУдаленияНенужныхПотребителей(Результат, ДопПараметры) Экспорт 
	Если Результат = Неопределено 
		ИЛИ Результат = КодВозвратаДиалога.Нет 
		ИЛИ Результат = КодВозвратаДиалога.Отмена Тогда 
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьТаблицуОтНенужныхАбонентов(ДопПараметры);		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТаблицуОтНенужныхАбонентов(ДопПараметры)
	Для Каждого ТекАбонент из ДопПараметры.НенужныеАбоненты Цикл 
		//ТаблицаОчистки 	= Объект.Абоненты;
		Отбор 			= Новый Структура("Абонент", ТекАбонент);
		энргОбщегоНазначения.ОчиститьТаблицуПоУсловию(Объект.Абоненты, Отбор);
	КонецЦикла;
КонецПроцедуры


#КонецОбласти


#Область СобытияПередачиНаСогласования

&НаКлиенте
Процедура ПередатьНаСогласование(Команда)
	Ошибки = ОшибкиПередОтправкойНаСогласование();
	Если Ошибки.Количество() > 0 Тогда
		ПоказатьПредупреждение(, СтрСоединить(Ошибки, Символы.ПС));
		Возврат;
	КонецЕсли;	
	
	Результат = ПередатьНаСогласованиеНаСервере();
	ОбновитьНадписьСтатусаСобытия();
	ПоказатьПредупреждение(, Результат); 	
КонецПроцедуры

&НаСервере
Функция ПередатьНаСогласованиеНаСервере()
	Результат 				= "Статус успешно зарегистрирован";
	МенеджерРегистра 		= РегистрыСведений.энргСтатусСогласованияСобытий;
	
	ОписаниеОжидаемыхДанных = МенеджерРегистра.ПолучитьОписаниеОбъекта();
	ОписаниеОжидаемыхДанных.Организация 	= Объект.Организация;
	ОписаниеОжидаемыхДанных.Район 			= Объект.Район;
	ОписаниеОжидаемыхДанных.ДокРегистратор 	= Объект.Ссылка;
	ОписаниеОжидаемыхДанных.Исполнитель 	= Объект.Согласующий;
	ОписаниеОжидаемыхДанных.Статус 			= Перечисления.энргСтатусыСогласованияСобытий.ТребуетСогласования;
	
	Попытка
		МенеджерРегистра.ЗарегистрироватьСтатусПередачаНаСогласование(ТекущаяДата(), ОписаниеОжидаемыхДанных);
		СтатусСогласования = ОписаниеОжидаемыхДанных.Статус;
	Исключение
		ИнформацияОбОшибке		= ИнформацияОбОшибке();
		Результат 				= "Статус не зарегистрирован по причине: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		
		Комментарий				= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		НеобязательныеПараметры = энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
		НеобязательныеПараметры.ВыводитьСообщениеПользователю = Ложь;		
		энргОбщегоНазначения.ЗарегистрироватьОшибку("Изменение статуса", УровеньЖурналаРегистрации.Ошибка, Комментарий, НеобязательныеПараметры); 		
	КонецПопытки;
	
	Возврат Результат;	
КонецФункции


&НаКлиенте
Функция ОшибкиПередОтправкойНаСогласование()
	Ошибки = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(Объект.Согласующий) Тогда
		Ошибки.Добавить("Не указано поле Согласующий");
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда 
		Ошибки.Добавить("Необходимо Записать объект");	
	КонецЕсли;	
	
	Возврат Ошибки;	
КонецФункции

#КонецОбласти

#Область СобытияСогласования

&НаКлиенте
Процедура Согласовать(Команда)
	Ошибки = ОшибкиПередСогласованием();
	Если Ошибки.Количество() > 0 Тогда
		ПоказатьПредупреждение(, СтрСоединить(Ошибки, Символы.ПС));
		Возврат;
	КонецЕсли;	
	
	Результат = СогласоватьНаСервере();
	ОбновитьНадписьСтатусаСобытия();
	ПоказатьПредупреждение(, Результат);
КонецПроцедуры

&НаСервере
Функция СогласоватьНаСервере()
	ТекстУспеха				= "Статус успешно зарегистрирован";
	
	Результат 				= ТекстУспеха;
	МенеджерРегистра 		= РегистрыСведений.энргСтатусСогласованияСобытий;
	ОписаниеОжидаемыхДанных = МенеджерРегистра.ПолучитьОписаниеОбъекта();
	ПериодСогласования						= ТекущаяДата();
	ОписаниеОжидаемыхДанных.Организация 	= Объект.Организация;
	ОписаниеОжидаемыхДанных.Район 			= Объект.Район;
	ОписаниеОжидаемыхДанных.ДокРегистратор 	= Объект.Ссылка;
	ОписаниеОжидаемыхДанных.Исполнитель 	= Пользователи.ТекущийПользователь();
	ОписаниеОжидаемыхДанных.Статус 			= Перечисления.энргСтатусыСогласованияСобытий.Согласовано;
	
	Документы.энргСобытие.ЗарегистрироватьСтатусСогласовано(МенеджерРегистра, ПериодСогласования, ОписаниеОжидаемыхДанных, Результат);
	Если Результат = ТекстУспеха Тогда 
		ДатаСогласования	= ПериодСогласования;
		СтатусСогласования 	= ОписаниеОжидаемыхДанных.Статус;
	КонецЕсли;
	
	//Попытка
	//	МенеджерРегистра.ЗарегистрироватьСтатусСогласовано(ПериодСогласования, ОписаниеОжидаемыхДанных);
	//	ДатаСогласования	= ПериодСогласования;
	//	СтатусСогласования 	= ОписаниеОжидаемыхДанных.Статус;
	//Исключение
	//    ИнформацияОбОшибке		= ИнформацияОбОшибке();
	//	Результат 				= "Статус не зарегистрирован по причине: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	//	
	//	Комментарий				= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	//	НеобязательныеПараметры = энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
	//	НеобязательныеПараметры.ВыводитьСообщениеПользователю = Ложь;		
	//	энргОбщегоНазначения.ЗарегистрироватьОшибку("Изменение статуса", УровеньЖурналаРегистрации.Ошибка, Комментарий, НеобязательныеПараметры); 		
	//КонецПопытки;
	
	Возврат Результат;	
КонецФункции


&НаКлиенте
Функция ОшибкиПередСогласованием()
	Ошибки = Новый Массив;
	Если Параметры.Ключ.Пустая() Тогда 
		Ошибки.Добавить("Необходимо Записать объект");	
	КонецЕсли;
	
	Возврат Ошибки;	
КонецФункции

#КонецОбласти

#Область СобытияВернутьНаДоработку

&НаКлиенте
Процедура ВернутьНаДоработку(Команда)
	Ошибки = ОшибкиПередВернутьНаДоработку();
	Если Ошибки.Количество() > 0 Тогда
		ПоказатьПредупреждение(, СтрСоединить(Ошибки, Символы.ПС));
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьРезультатЗапросаНаДоработку", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.энргСтатусСогласованияСобытий.Форма.ФормаВернутьНаДоработку",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатЗапросаНаДоработку(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	РезультатСменыСтатуса = ВернутьНаДоработкуНаСервере(Результат);
	ОбновитьНадписьСтатусаСобытия();
	ПоказатьПредупреждение(, РезультатСменыСтатуса);
КонецПроцедуры

&НаСервере
Функция ВернутьНаДоработкуНаСервере(СтруктураОтвета)
	ТекстУспеха				= "Статус успешно зарегистрирован";
	
	Результат 				= ТекстУспеха;
	МенеджерРегистра 		= РегистрыСведений.энргСтатусСогласованияСобытий;
	ОписаниеОжидаемыхДанных = МенеджерРегистра.ПолучитьОписаниеОбъекта();
	ПериодСогласования						= ТекущаяДата();
	ОписаниеОжидаемыхДанных.Организация 	= Объект.Организация;
	ОписаниеОжидаемыхДанных.Район 			= Объект.Район;
	ОписаниеОжидаемыхДанных.ДокРегистратор 	= Объект.Ссылка;
	ОписаниеОжидаемыхДанных.Исполнитель 	= СтруктураОтвета.Исполнитель;
	ОписаниеОжидаемыхДанных.Комментарий 	= СтруктураОтвета.Комментарий;
	ОписаниеОжидаемыхДанных.Статус 			= Перечисления.энргСтатусыСогласованияСобытий.ТребуетДоработки;
	
	Документы.энргСобытие.ЗарегистрироватьСтатусВернутьНаДоработку(МенеджерРегистра, ПериодСогласования, ОписаниеОжидаемыхДанных, Результат);
	Если Результат = ТекстУспеха Тогда 
		СтатусСогласования 	= ОписаниеОжидаемыхДанных.Статус;
		Комментарий			= ОписаниеОжидаемыхДанных.Комментарий;
	КонецЕсли;
	
	//Попытка
	//	МенеджерРегистра.ЗарегистрироватьСтатусВернутьНаДоработку(ТекущаяДата(), ОписаниеОжидаемыхДанных);
	//	СтатусСогласования = ОписаниеОжидаемыхДанных.Статус;
	//Исключение
	//    ИнформацияОбОшибке		= ИнформацияОбОшибке();
	//	Результат 				= "Статус не зарегистрирован по причине: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	//	
	//	Комментарий				= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
	//	НеобязательныеПараметры = энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
	//	НеобязательныеПараметры.ВыводитьСообщениеПользователю = Ложь;		
	//	энргОбщегоНазначения.ЗарегистрироватьОшибку("Изменение статуса", УровеньЖурналаРегистрации.Ошибка, Комментарий, НеобязательныеПараметры); 		
	//КонецПопытки;
	
	Возврат Результат;	
КонецФункции


&НаКлиенте
Функция ОшибкиПередВернутьНаДоработку()
	Ошибки = Новый Массив;
	Если Параметры.Ключ.Пустая() Тогда 
		Ошибки.Добавить("Необходимо Записать объект");	
	КонецЕсли;
	
	Возврат Ошибки;	
КонецФункции

#КонецОбласти


#Область СобытияВыполнения

&НаКлиенте
Процедура Выполнено(Команда)
	НедостаточноФайлов = Ложь;
	энргРаботаСПрикрепленнымиФайламиКлиент.ПередЗаписью(НедостаточноФайлов, ЭтотОбъект);
	Если НедостаточноФайлов Тогда
		Возврат;
	КонецЕсли;
	
	Ошибки = ОшибкиПередРегистрациейВыполненияСобытия();
	Если Ошибки.Количество() > 0 Тогда
		ПоказатьПредупреждение(, СтрСоединить(Ошибки, Символы.ПС));
		Возврат;
	КонецЕсли;
	
	Результат = ЗарегистрироватьСтатусВыполнен();
	ОбновитьНадписьСтатусаСобытия();
	ПоказатьПредупреждение(, Результат);	
КонецПроцедуры

&НаСервере
Функция ЗарегистрироватьСтатусВыполнен()
	Результат 				= "Событие выполнено успешно";
	МенеджерРегистра 		= РегистрыСведений.энргСтатусВыполненияСобытий;
	ОписаниеОжидаемыхДанных = МенеджерРегистра.ПолучитьОписаниеОбъекта();
	ПериодВыполнения		= ТекущаяДата();
	ОписаниеОжидаемыхДанных.Организация 	= Объект.Организация;
	ОписаниеОжидаемыхДанных.Район 			= Объект.Район;
	ОписаниеОжидаемыхДанных.ДокРегистратор 	= Объект.Ссылка;
	ОписаниеОжидаемыхДанных.Ответственный 	= Пользователи.ТекущийПользователь();
	ОписаниеОжидаемыхДанных.Статус 			= Истина;
	
	Попытка
		МенеджерРегистра.ЗарегистрироватьСтатусВыполнен(ПериодВыполнения, ОписаниеОжидаемыхДанных);
		Исполнитель 		= ОписаниеОжидаемыхДанных.Ответственный;
		ДатаВыполнения 		= ПериодВыполнения;
		СтатусВыполнения	= Истина;
	Исключение
		ИнформацияОбОшибке		= ИнформацияОбОшибке();
		Результат 				= "Событие не выполнено по причине: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		
		Комментарий				= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		НеобязательныеПараметры = энргОбщегоНазначения.НеобязательныеПараметрыРегистацииОшибки();
		НеобязательныеПараметры.ВыводитьСообщениеПользователю = Ложь;		
		энргОбщегоНазначения.ЗарегистрироватьОшибку("Выполнение события", УровеньЖурналаРегистрации.Ошибка, Комментарий, НеобязательныеПараметры); 		
	КонецПопытки;
	
	Возврат Результат;	
КонецФункции


&НаКлиенте
Функция ОшибкиПередРегистрациейВыполненияСобытия()
	Ошибки = Новый Массив;
	Если Параметры.Ключ.Пустая() Тогда 
		Ошибки.Добавить("Необходимо Записать объект");	
	КонецЕсли;
	
	ТребуетСогласования = ПолучитьСвойствоТребуетСогласования();
	Если ТребуетСогласования и НЕ СтатусСогласования = ПредопределенноеЗначение("Перечисление.энргСтатусыСогласованияСобытий.Согласовано") Тогда 
		Ошибки.Добавить("Событие не согласовано");	
	КонецЕсли;
	
	Возврат Ошибки;	
КонецФункции

#КонецОбласти


#Область РаботаСТаблицейПараметры

&НаСервере
Процедура ЗаполнитьПараметрыНаСервере()
	
	ЗначПарам = Новый Соответствие;
	
	Для каждого СтрокаТЧ Из Объект.Параметры Цикл
		ЗначПарам.Вставить(СтрокаТЧ.Параметр, СтрокаТЧ.Значение);
	КонецЦикла;
	
	
	Объект.Параметры.Очистить();
	
	СписокПараметровТипа = Справочники.энргСпособСвязи.ПолучитьСписокПараметров(Объект.ТипСобытия);
	
	Для каждого Параметр Из СписокПараметровТипа Цикл
		
		Если ЗначениеЗаполнено(Параметр) Тогда
			Значение = ЗначПарам.Получить(Параметр);			
			
			Если Параметр = ПланыВидовХарактеристик.бестПараметрыТиповСобытий.ТелефонАбонента И Объект.Одинарный И ЗначениеЗаполнено(Объект.Абоненты) Тогда	
				СтрокаТЧ 			= Объект.Параметры.Добавить();			
				СтрокаТЧ.Параметр 	= Параметр;
				СтрокаТЧ.Значение = Документы.энргСобытие.ПолучитьТелефонАбонента(Объект.Абоненты[0].Абонент, Истина);
				
			ИначеЕсли Параметр = ПланыВидовХарактеристик.бестПараметрыТиповСобытий.АдресЭлектроннойПочты И Объект.Одинарный И ЗначениеЗаполнено(Объект.Абоненты) Тогда	
				СтрокаТЧ 			= Объект.Параметры.Добавить();			
				СтрокаТЧ.Параметр 	= Параметр;
				СтрокаТЧ.Значение = Документы.энргСобытие.ПолучитьЭлектроннуюПочтуАбонента(Объект.Абоненты[0].Абонент);
				
			ИначеЕсли Параметр = ПланыВидовХарактеристик.бестПараметрыТиповСобытий.Суд_СудебныйУчасток Тогда
				СтрокаТЧ 			= Объект.Параметры.Добавить();			
				СтрокаТЧ.Параметр 	= Параметр;
				СтрокаТч.Значение = СудебноеУчреждение(Объект.Абоненты[0].Основание);						
				
			ИначеЕсли не Значение = Неопределено Тогда		
				СтрокаТЧ 			= Объект.Параметры.Добавить();			
				СтрокаТЧ.Параметр 	= Параметр;
				СтрокаТЧ.Значение = Значение;
			Иначе
				СтрокаТЧ 			= Объект.Параметры.Добавить();			
				СтрокаТЧ.Параметр 	= Параметр;				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СудебноеУчреждение(Основание)
	ОтборСтроения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "МКД");
	Возврат Справочники.энргСудебныеУчастки.ПолучитьСудебноеУчреждениеПоСтроению(ОтборСтроения);	
КонецФункции

#КонецОбласти

#Область СобытияОтправкиПисьмаНаПочту

&НаКлиенте
Процедура ОтправитьУведомление(Команда)
	Ошибки = ОшибкиПередРегистрациейВыполненияСобытия();
	Если Ошибки.Количество() > 0 Тогда
		ПоказатьПредупреждение(, СтрСоединить(Ошибки, Символы.ПС));
		Возврат;
	КонецЕсли;
	
	Результат = ЗарегистрироватьСтатусВыполнен();
	ОбновитьНадписьСтатусаСобытия();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура УправлениеВидимостью()
	УправлениеВидимостьюФункцийСогласования();
	УправлениеВидимостьюФункцииОтправкиНаПочту();
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюФункцийСогласования()
	ЗначениеСвойства = ПолучитьСвойствоТребуетСогласования();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаГруппаСогласования", "Видимость", ЗначениеСвойства);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Согласование"			, "Видимость", ЗначениеСвойства);
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюФункцийПечати()
	СписокМакетовТипа = ПолучитьТипыМакетов();
	МакетПоиска = Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаПечать.ПодчиненныеЭлементы;
	Для каждого Строка Из  МакетПоиска Цикл 
		Строка.Видимость = Ложь;
	КонецЦикла;
	
	Для каждого Макет Из СписокМакетовТипа Цикл
		Если ЗначениеЗаполнено(Макет) Тогда
			Для каждого Строка Из  МакетПоиска Цикл
				Если СтрЗаменить(ВРег(Макет), " ", "") = Сред(Врег(Строка.Имя),38) Тогда
					Строка.Видимость = Истина;
				КонецЕсли;  				
			КонецЦикла;			
		КонецЕсли;
	КонецЦикла; 	
КонецПроцедуры 

&НаСервере
Процедура УправлениеВидимостьюФункцииОтправкиНаПочту()
	ЗначениеСвойства = ПолучитьСвойствоСобытиеОтправки();
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СпособОтправки"	, "Видимость", ЗначениеСвойства);
	
	ЗначениеСвойства = Объект.СпособОтправки = ПредопределенноеЗначение("Справочник.энргСпособыОтправкиУведомлений.ЭлектроннаяПочта");	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаОтправитьУведомление"	, "Видимость", ЗначениеСвойства);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Выполнено"					, "Видимость", НЕ ЗначениеСвойства);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФормаПередатьНаСогласование", "Видимость", НЕ ЗначениеСвойства);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Группа7"					, "Видимость", ЗначениеСвойства);
	
	ЗначениеСвойства = ПустаяСтрока(Объект.МакетПечатнойФормы);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаШаблонСообщения", "Видимость", ЗначениеСвойства);
КонецПроцедуры

&НаСервере
Функция ПолучитьТипыМакетов()
СписокМакетовТипа = Справочники.энргСпособСвязи.ПолучитьСписокМакетовПФ(Объект.ТипСобытия);
Возврат СписокМакетовТипа;	
КонецФункции

&НаКлиенте
Процедура УстановитьПараметрыВыбораПриИзмененииТипСобытия()
	// Этапы
	МассивЭтапов 		= ПолучитьМассивЭтаповИзТипаСобытия();
	НовыйМассив 		= Новый Массив;
	Если НЕ МассивЭтапов.Количество() = 0 Тогда		
		НовыйПараметр 							= Новый ПараметрВыбора("Отбор.Ссылка", МассивЭтапов);		
		НовыйМассив.Добавить(НовыйПараметр);
		ЗначениеСвойства 						= Новый ФиксированныйМассив(НовыйМассив);
	Иначе 
		ЗначениеСвойства						= Новый ФиксированныйМассив(НовыйМассив);
	КонецЕсли; 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Этап", "ПараметрыВыбора", ЗначениеСвойства);
	
	// Согласующие
	МассивСогласующих 	= ПолучитьДоступныеСогласующиеИзТипаСобытия();
	НовыйМассив 		= Новый Массив;
	Если НЕ МассивСогласующих.Количество() = 0 Тогда		
		НовыйПараметр 							= Новый ПараметрВыбора("Отбор.Ссылка", МассивСогласующих);		
		НовыйМассив.Добавить(НовыйПараметр);
		ЗначениеСвойства 						= Новый ФиксированныйМассив(НовыйМассив);
	Иначе 
		ЗначениеСвойства						= Новый ФиксированныйМассив(НовыйМассив);
	КонецЕсли; 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Согласующий", "ПараметрыВыбора", ЗначениеСвойства);	
КонецПроцедуры


&НаСервере
Процедура ИзменитьНазванияПолейТЧ()
	Если Объект.ТипСобытия 	= Справочники.энргСпособСвязи.НаправлениеУведомленияИсполнителюНаВводОРП 			ИЛИ
		Объект.ТипСобытия 	= Справочники.энргСпособСвязи.НаправлениеУведомленияИсполнителюОПереносеОРП 		ИЛИ
		Объект.ТипСобытия 	= Справочники.энргСпособСвязи.НаправлениеУведомленияИсполнителюОбОтменеОРП 			ИЛИ
		Объект.ТипСобытия 	= Справочники.энргСпособСвязи.НаправлениеУведомленияОВозобновленииЭнергоснабжения 	Тогда
		Элементы.Абоненты.ПодчиненныеЭлементы.ПотребителиАбонент.Заголовок = "Абоненты";
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ОбновитьСтатусСогласованияСобытия()
	Результат 	= энргОбщегоНазначения.ПолучитьАктуальныйСтатусСобытия(ТекущаяДата(), Объект.Организация, Объект.Район, Объект.Ссылка);
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	СтатусСогласования = Выборка.Статус;
	Если СтатусСогласования = Перечисления.энргСтатусыСогласованияСобытий.Согласовано Тогда
		ДатаСогласования = Выборка.Период;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусВыполненияСобытия()
	Результат = энргОбщегоНазначения.ПолучитьАктуальныйСтатусВыполненияСобытия(ТекущаяДата(), Объект.Организация, Объект.Район, Объект.Ссылка);
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка 	= Результат.Выбрать();
	Выборка.Следующий();
	
	СтатусВыполнения = Выборка.Статус;
	Если Выборка.Статус Тогда
		Исполнитель 	= Выборка.Ответственный;
		ДатаВыполнения 	= Выборка.Период;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПочтуУАбонентов()
	Для каждого стр из Объект.Абоненты Цикл
		Абонент = стр.Абонент;
		Если ТипЗнч(Абонент) = Тип("СправочникСсылка.энргДоговорыКонтрагентов") Тогда
			Контрагент = Абонент.Контрагент;
			КИ = Контрагент.КонтактнаяИнформация;
			мПочта = КИ.НайтиСтроки(Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.EmailКонтрагента));
			Для каждого Адрес из мПочта Цикл
				НовСтр = Объект.Параметры.Добавить();
				НовСтр.Параметр = ПланыВидовХарактеристик.бестПараметрыТиповСобытий.АдресЭлектроннойПочты;
				НовСтр.Значение = Адрес.Представление;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ОбновитьПочтуУАбонентов()

&НаСервере
Процедура ОбновитьНадписьСтатусаСобытия()
	ЗначениеСвойства = "Статус: ";
	Если СтатусВыполнения Тогда 
		ЗначениеСвойства = ЗначениеСвойства + "Выполнено";
	Иначе
		ЗначениеСвойства = ЗначениеСвойства + СтатусСогласования;
	КонецЕсли; 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "СтатусСобытия", "Заголовок", ЗначениеСвойства);
КонецПроцедуры



&НаСервере
Функция ПолучитьСвойствоТребуетСогласования()
	Если ЗначениеЗаполнено(Объект.ТипСобытия) Тогда 
		ЗначениеСвойства = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТипСобытия, "ТребуетСогласования");
	Иначе 
		ЗначениеСвойства = Ложь;
	КонецЕсли;
	
	Возврат ЗначениеСвойства;
КонецФункции

&НаСервере
Функция ПолучитьСвойствоСобытиеОтправки()
	Если ЗначениеЗаполнено(Объект.ТипСобытия) Тогда 
		ЗначениеСвойства = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТипСобытия, "СобытиеОтправки");
	Иначе 
		ЗначениеСвойства = Ложь;
	КонецЕсли;
	
	Возврат ЗначениеСвойства;
КонецФункции

&НаСервере
Функция ПолучитьМассивЭтаповИзТипаСобытия()	
	Возврат Справочники.энргСпособСвязи.ПолучитьДоступныеЭтапыПИР(Объект.ТипСобытия);
КонецФункции

&НаСервере
Функция ПолучитьДоступныеСогласующиеИзТипаСобытия()
	Результат 	= Новый Массив;
	
	МассивРолей = Справочники.энргСпособСвязи.ПолучитьРолиСогласующих(Объект.ТипСобытия);
	Если МассивРолей.Количество() = 0 Тогда 
		Возврат Результат;
	КонецЕсли;
	
	РезультатЗапроса	= энргОбщегоНазначения.ПолучитьПользователейСОтборомПоРолям(Объект.Организация, Объект.Район, МассивРолей);
	Результат			= РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Пользователь");
	
	Возврат Результат
КонецФункции


&НаСервере
Функция ПолучитьНенужныхАбонентов()
	Результат 				= Новый Массив;
	
	Период 					= Новый Граница(Объект.Дата, ВидГраницы.Исключая);
	СписокАбонентовОтбор 	= Объект.Абоненты.Выгрузить().ВыгрузитьКолонку("Абонент");
	РезультатЗапроса		= Задачи.энргЗадачаПИД.ПолучитьЗадачиПринятыеВРаботуПоАбонентам(Период, СписокАбонентовОтбор);
	Выборка 				= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(СписокАбонентовОтбор, Выборка.Абонент);
	КонецЦикла;
	
	Если НЕ СписокАбонентовОтбор.Количество() = 0 Тогда
		Результат = СписокАбонентовОтбор;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область РасчетСроковВУведомленииОВводеОРП

&НаСервере
Процедура РасчитатьСрокиОУведомленииОВводеОРП()
	Если НЕ Объект.ТипСобытия = Справочники.энргСпособСвязи.НаправлениеУведомленияНаВводОРП Тогда 
		Возврат;
	КонецЕсли;
	
	Если Объект.СпособОтправки = Справочники.энргСпособыОтправкиУведомлений.ЗаказнойПочтой Тогда
		РасчитатьСрокиОРППриОтправкеЗаказнойПочтой();	
	ИначеЕсли Объект.СпособОтправки = Справочники.энргСпособыОтправкиУведомлений.ВручитьПодРоспись Тогда 
		РасчитатьСрокиОРППриВручинииПодРоспись();	
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура РасчитатьСрокиОРППриОтправкеЗаказнойПочтой()
	ПВХ				= ПланыВидовХарактеристик.бестПараметрыТиповСобытий.СрокПогашенияЗадолженности;
	ИскомыеСтроки 	= Объект.Параметры.НайтиСтроки(Новый Структура("Параметр", ПВХ));
	Если ИскомыеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден параметр: " + ПВХ);
		Возврат;
	КонецЕсли;
	
	СрокДляОтправкиЗаказнойПочтой = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПВХ, "СрокДляОтправкиЗаказнойПочтой");
	
	СтрокаПараметра 			= ИскомыеСтроки[0];
	СтрокаПараметра.Значение 	= Объект.Дата + (86400 * СрокДляОтправкиЗаказнойПочтой);	
КонецПроцедуры

&НаСервере
Процедура РасчитатьСрокиОРППриВручинииПодРоспись()
	ПВХ				= ПланыВидовХарактеристик.бестПараметрыТиповСобытий.СрокПогашенияЗадолженности;
	ИскомыеСтроки 	= Объект.Параметры.НайтиСтроки(Новый Структура("Параметр", ПВХ));
	Если ИскомыеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден параметр: " + ПВХ);
		Возврат;
	КонецЕсли;
	
	СрокДляВрученияПодРоспись 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПВХ, "СрокДляВрученияПодРоспись");		
	СтрокаПараметра 			= ИскомыеСтроки[0];
	ДатаПогашенияЗадолженности	= Объект.Дата + (86400 * СрокДляВрученияПодРоспись);
	СтрокаПараметра.Значение 	= ДатаПогашенияЗадолженности;
	
	
	ПВХ				= ПланыВидовХарактеристик.бестПараметрыТиповСобытий.ПланируемаяДатаВведенияОРП;
	ИскомыеСтроки 	= Объект.Параметры.НайтиСтроки(Новый Структура("Параметр", ПВХ));
	Если ИскомыеСтроки.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найден параметр: " + ПВХ);
		Возврат;
	КонецЕсли;
	
	СрокДляВрученияПодРоспись 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПВХ, "СрокОтКрайнейДатыПогашенияДолга");		
	СтрокаПараметра 			= ИскомыеСтроки[0];
	СтрокаПараметра.Значение 	= ДатаПогашенияЗадолженности + (86400 * СрокДляВрученияПодРоспись);	
КонецПроцедуры

#КонецОбласти

#Область РаботаСШаблономСообщений

&НаСервере
Процедура ИнициализироватьШаблоныСообщений()
	Справочники.энргШаблоныСообщений.ДобавлениеКомандПараметров(ЭтаФорма, "КомандыПараметрыТемы", "КомТемы", "ВставитьПараметр");
	Справочники.энргШаблоныСообщений.ДобавлениеКомандПараметров(ЭтаФорма, "КомандыПараметрыТекста", "КомТекста", "ВставитьПараметр");
	
	Элементы.МакетПечатнойФормы.СписокВыбора.Очистить();
	СписокМакетов = Справочники.энргВидыОперацийПИД.ПолучитьСписокМакетовПечати();
	Элементы.МакетПечатнойФормы.СписокВыбора.Добавить("", "Нет");
	Для каждого ТекЭлем Из СписокМакетов Цикл
		Элементы.МакетПечатнойФормы.СписокВыбора.Добавить(ТекЭлем.Значение, ТекЭлем.Представление);
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ВставитьПараметр(Команда)
	Если Лев(Команда.Имя, 7) = "КомТемы" Тогда
		Элемент = Элементы.ТемаСобытия;
	Иначе
		Элемент = Элементы.ТекстШаблона;
	КонецЕсли;
	
	Элемент.ВыделенныйТекст = ВставитьПараметрНаСервере(Команда.Имя);
КонецПроцедуры

&НаСервере
Функция ВставитьПараметрНаСервере(ИмяКоманды)
	Префикс = ?(Лев(ИмяКоманды, 7) = "КомТемы", "КомТемы", "КомТекста");
	Возврат Справочники.энргШаблоныСообщений.ЗаменаКоманды(ИмяКоманды, Префикс); 
КонецФункции

&НаКлиенте
Процедура ВыбратьШаблон(Команда)
	ОткрытьФорму("Справочник.энргШаблоныСообщений.ФормаВыбора",, Элементы.ТекстШаблона);
КонецПроцедуры

&НаКлиенте
Процедура МакетПечатнойФормыПриИзменении(Элемент)
	УправлениеВидимостью();
	//ЗначениеСвойства = Объект.СпособОтправки = ПредопределенноеЗначение("Справочник.энргСпособыОтправкиУведомлений.ЭлектроннаяПочта");	
	//ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Группа7", "Видимость", ЗначениеСвойства);
КонецПроцедуры

&НаКлиенте
Процедура ТемаСобытияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.энргШаблоныСообщений.ФормаВыбора",, Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТемаСобытияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Объект.ТемаСобытия = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Наименование"); 
		Объект.ТекстШаблона = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ТекстШаблона"); 
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ТекстШаблонаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Объект.ТемаСобытия 	= энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Наименование");
		Объект.ТекстШаблона = энргОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "ТекстШаблона"); 
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
